In [1]:
from sqlalchemy import create_engine,text
import pandas as pd
import os

In [2]:
engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
print(engine1)

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [5]:
def q(sql, **params):
    with engine1.connect() as conn:
        return pd.read_sql(text(sql), conn, params=params)

In [6]:
q("SELECT * FROM team1")

   ser_id first_name last_name  age  Salary
0    1001    Akhansh    Mandal   26  125715
1    1002    Muhammd    Kabeer   41  125715
2    1003     Suroor     Ahmed   25  100572
3    1004   Jugartha  Halchemy   28   83810
4    1005    Nayeema    Zannat   25   83810
5    1006   Amandeep      Kaur   25   83810
6    1007    Sultana   Parveen   25   83810
7    1008     Sharan     Shaha   23   83810
8    1009     Delwar   Hossain   28   92191

In [7]:
##connection done

In [8]:
data=pd.read_csv(r"C:\Users\13616\OneDrive\Desktop\assignment muhammad\Indian_Flight_Data-main\menu_items.csv")

In [9]:
data.head()

   menu_item_id      item_name  category  price
0           101      Hamburger  American  12.95
1           102   Cheeseburger  American  13.95
2           103        Hot Dog  American   9.00
3           104  Veggie Burger  American  10.50
4           105   Mac & Cheese  American   7.00

In [12]:
data.to_sql( name='menu_items', con=engine1, if_exists='append', index=False )##sending table to SQL database

32

In [13]:
#data check follows

In [15]:
q("SELECT * FROM menu_items limit 5")

   menu_item_id      item_name  category  price
0           101      Hamburger  American  12.95
1           102   Cheeseburger  American  13.95
2           103        Hot Dog  American   9.00
3           104  Veggie Burger  American  10.50
4           105   Mac & Cheese  American   7.00

In [20]:
data1=pd.read_csv(r"C:\Users\13616\OneDrive\Desktop\assignment muhammad\Indian_Flight_Data-main\order_details.csv")

In [21]:
data1.head(5)

   order_details_id  order_id order_date   order_time  item_id
0                 1         1   1/1/2023  11:38:36 AM    109.0
1                 2         2   1/1/2023  11:57:40 AM    108.0
2                 3         2   1/1/2023  11:57:40 AM    124.0
3                 4         2   1/1/2023  11:57:40 AM    117.0
4                 5         2   1/1/2023  11:57:40 AM    129.0

In [23]:
data.describe()

       order_details_id      order_id       item_id
count      12234.000000  12234.000000  12097.000000
mean        6117.500000   2691.927415    115.202282
std         3531.795931   1546.026261      9.387580
min            1.000000      1.000000    101.000000
25%         3059.250000   1351.250000    107.000000
50%         6117.500000   2710.000000    114.000000
75%         9175.750000   4020.000000    123.000000
max        12234.000000   5370.000000    132.000000

In [24]:
data1.describe()

       order_details_id      order_id       item_id
count      12234.000000  12234.000000  12097.000000
mean        6117.500000   2691.927415    115.202282
std         3531.795931   1546.026261      9.387580
min            1.000000      1.000000    101.000000
25%         3059.250000   1351.250000    107.000000
50%         6117.500000   2710.000000    114.000000
75%         9175.750000   4020.000000    123.000000
max        12234.000000   5370.000000    132.000000

In [27]:
data.to_sql( name='order_details', con=engine1, if_exists='append', index=False )##sending table to SQL database

12234

In [28]:
##data check in SQL

q("SELECT * from order_details limit 5 ")

### The Assignment is to dig into customer data of a resturant to see which menu items are doing well/not well 
and what the top customerds seem to like best

### The objective is to explore the menu items table to get an idea of whats is on the menu,
explore the order detail table to get an idea of the data thats been collected
And Analyze both table to understand customers behaveour to the new menu introduced.

In [37]:
##view the menu_items table

q("select * from menu_items")

In [40]:
##find number of items on the menu

In [41]:
q("select count(*) from menu_items")

   count(*)
0        64

In [42]:
##What r the least and most expensive items on the menu

In [48]:
q("select * from menu_items order by price limit 10")

   menu_item_id      item_name  category  price
0           113        Edamame     Asian    5.0
1           113        Edamame     Asian    5.0
2           122  Chips & Salsa   Mexican    7.0
3           106   French Fries  American    7.0
4           122  Chips & Salsa   Mexican    7.0
5           105   Mac & Cheese  American    7.0
6           106   French Fries  American    7.0
7           105   Mac & Cheese  American    7.0
8           103        Hot Dog  American    9.0
9           103        Hot Dog  American    9.0

In [49]:
q("select * from menu_items order by price desc limit 10")

   menu_item_id              item_name category  price
0           130          Shrimp Scampi  Italian  19.95
1           130          Shrimp Scampi  Italian  19.95
2           109       Korean Beef Bowl    Asian  17.95
3           125  Spaghetti & Meatballs  Italian  17.95
4           127           Meat Lasagna  Italian  17.95
5           109       Korean Beef Bowl    Asian  17.95
6           110             Pork Ramen    Asian  17.95
7           131       Chicken Parmesan  Italian  17.95
8           127           Meat Lasagna  Italian  17.95
9           125  Spaghetti & Meatballs  Italian  17.95

In [50]:
## How many italian dishes r on the menu??

In [51]:
q("select count(*) from menu_items where category='Italian'")

   count(*)
0        18

In [53]:
##the least & most expensive Italian item querry

In [55]:
q("select * from menu_items where category='Italian' order by price")

    menu_item_id              item_name category  price
0            124              Spaghetti  Italian  14.50
1            126     Fettuccine Alfredo  Italian  14.50
2            124              Spaghetti  Italian  14.50
3            126     Fettuccine Alfredo  Italian  14.50
4            128         Cheese Lasagna  Italian  15.50
5            129       Mushroom Ravioli  Italian  15.50
6            128         Cheese Lasagna  Italian  15.50
7            129       Mushroom Ravioli  Italian  15.50
8            132      Eggplant Parmesan  Italian  16.95
9            132      Eggplant Parmesan  Italian  16.95
10           125  Spaghetti & Meatballs  Italian  17.95
11           127           Meat Lasagna  Italian  17.95
12           131       Chicken Parmesan  Italian  17.95
13           125  Spaghetti & Meatballs  Italian  17.95
14           127           Meat Lasagna  Italian  17.95
15           131       Chicken Parmesan  Italian  17.95
16           130          Shrimp Scampi  Italian  19.95
17           130          Shrimp Scampi  Italian  19.95

In [57]:
q("select * from menu_items where category='Italian' order by price desc") ##descending

    menu_item_id              item_name category  price
0            130          Shrimp Scampi  Italian  19.95
1            130          Shrimp Scampi  Italian  19.95
2            125  Spaghetti & Meatballs  Italian  17.95
3            127           Meat Lasagna  Italian  17.95
4            131       Chicken Parmesan  Italian  17.95
5            125  Spaghetti & Meatballs  Italian  17.95
6            127           Meat Lasagna  Italian  17.95
7            131       Chicken Parmesan  Italian  17.95
8            132      Eggplant Parmesan  Italian  16.95
9            132      Eggplant Parmesan  Italian  16.95
10           128         Cheese Lasagna  Italian  15.50
11           129       Mushroom Ravioli  Italian  15.50
12           128         Cheese Lasagna  Italian  15.50
13           129       Mushroom Ravioli  Italian  15.50
14           124              Spaghetti  Italian  14.50
15           126     Fettuccine Alfredo  Italian  14.50
16           124              Spaghetti  Italian  14.50
17           126     Fettuccine Alfredo  Italian  14.50

In [58]:
## How many dishes r in each category

In [59]:
q("select * from menu_items limit 5")

   menu_item_id      item_name  category  price
0           101      Hamburger  American  12.95
1           102   Cheeseburger  American  13.95
2           103        Hot Dog  American   9.00
3           104  Veggie Burger  American  10.50
4           105   Mac & Cheese  American   7.00

In [64]:
q("""
SELECT category, COUNT(menu_item_id) AS num_dishes
FROM menu_items
GROUP BY category
""")

   category  num_dishes
0  American          12
1     Asian          16
2   Mexican          18
3   Italian          18

In [65]:
## Avarage dish price within each category?

In [66]:
q("""
SELECT category, AVG(price) AS avg_price
FROM menu_items
GROUP BY category
""")

   category  avg_price
0  American  10.066667
1     Asian  13.475000
2   Mexican  11.800000
3   Italian  16.750000

### explore the order table

In [68]:
##view the order detail table

In [77]:
data.to_sql( name='order_details', con=engine1, if_exists='append', index=False )##sending table to SQL database

12234

In [78]:
q("select * from order_details ")

       order_details_id  order_id order_date   order_time  item_id
0                     1         1   1/1/2023  11:38:36 AM    109.0
1                     2         2   1/1/2023  11:57:40 AM    108.0
2                     3         2   1/1/2023  11:57:40 AM    124.0
3                     4         2   1/1/2023  11:57:40 AM    117.0
4                     5         2   1/1/2023  11:57:40 AM    129.0
...                 ...       ...        ...          ...      ...
24463             12230      5369  3/31/2023  10:05:04 PM    109.0
24464             12231      5369  3/31/2023  10:05:04 PM    129.0
24465             12232      5369  3/31/2023  10:05:04 PM    120.0
24466             12233      5369  3/31/2023  10:05:04 PM    122.0
24467             12234      5370  3/31/2023  10:15:48 PM    122.0

[24468 rows x 5 columns]

In [79]:
## What is the date range of the table

In [80]:
q("select * from order_details order by order_date ")

       order_details_id  order_id order_date   order_time  item_id
0                     8         3   1/1/2023  12:12:28 PM    119.0
1                    97        40   1/1/2023   5:14:36 PM    125.0
2                    96        39   1/1/2023   5:07:23 PM    117.0
3                    95        38   1/1/2023   5:03:00 PM    110.0
4                    94        38   1/1/2023   5:03:00 PM    109.0
...                 ...       ...        ...          ...      ...
24463              9211      4035   3/9/2023   5:54:50 PM    131.0
24464              9120      4000   3/9/2023  11:34:01 AM    126.0
24465              9213      4036   3/9/2023   5:56:04 PM    103.0
24466              9214      4036   3/9/2023   5:56:04 PM    125.0
24467              9169      4015   3/9/2023   2:05:48 PM    122.0

[24468 rows x 5 columns]

In [81]:
##Other way

In [87]:
q("select MIN(order_date), MAX(order_date) from order_details")

  MIN(order_date) MAX(order_date)
0        1/1/2023        3/9/2023

In [88]:
## How many order were made through these date range

In [89]:
q("select count(distinct order_id) from order_details")

   count(distinct order_id)
0                      5370

In [90]:
## Which order had the most number of items

In [91]:
q("select order_id, count(item_id) as num_items from order_details group by order_id")

      order_id  num_items
0            1          2
1            2         10
2            3          4
3            4          2
4            5          2
...        ...        ...
5365      5366          8
5366      5367          2
5367      5368          8
5368      5369          8
5369      5370          2

[5370 rows x 2 columns]

In [92]:
## The numbder of oders with most items

In [93]:
q("select order_id, count(item_id) as num_items from order_details group by order_id order by num_items desc")

      order_id  num_items
0          330         28
1          440         28
2          443         28
3         1957         28
4         2675         28
...        ...        ...
5365      4307          0
5366      4410          0
5367      4558          0
5368      4855          0
5369      4914          0

[5370 rows x 2 columns]

In [94]:
## How many order had more than 12 items

In [95]:
q("select order_id, count(item_id) as num_items from order_details group by order_id having num_items > 12")

     order_id  num_items
0           9         18
1          17         20
2          92         18
3         143         16
4         144         24
..        ...        ...
125      5264         16
126      5266         16
127      5315         14
128      5317         22
129      5322         14

[130 rows x 2 columns]

In [99]:
q("""
SELECT COUNT(*)
FROM (
    SELECT order_id, COUNT(item_id) AS num_items
    FROM order_details
    GROUP BY order_id
    HAVING COUNT(item_id) > 12
) AS t
""")

   COUNT(*)
0       130

### the third objective is to Analyze customer behavour

In [100]:
## First thing to do is to combine  the tables

In [103]:
q("""
SELECT 
    od.order_id,
    od.order_date,
    mi.item_name,
    mi.category,
    mi.price
FROM order_details od
LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id
""")

       order_id order_date         item_name category  price
0             1   1/1/2023  Korean Beef Bowl    Asian  17.95
1             1   1/1/2023  Korean Beef Bowl    Asian  17.95
2             2   1/1/2023     Tofu Pad Thai    Asian  14.50
3             2   1/1/2023     Tofu Pad Thai    Asian  14.50
4             2   1/1/2023         Spaghetti  Italian  14.50
...         ...        ...               ...      ...    ...
48657      5369  3/31/2023       Steak Torta  Mexican  13.95
48658      5369  3/31/2023     Chips & Salsa  Mexican   7.00
48659      5369  3/31/2023     Chips & Salsa  Mexican   7.00
48660      5370  3/31/2023     Chips & Salsa  Mexican   7.00
48661      5370  3/31/2023     Chips & Salsa  Mexican   7.00

[48662 rows x 5 columns]

In [105]:
q("""
SELECT 
    mi.item_name,
    mi.category,
    COUNT(od.order_id) AS total_orders,
    AVG(mi.price) AS avg_price
FROM order_details od
LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id
GROUP BY mi.item_name, mi.category
""")

                item_name  category  total_orders  avg_price
0        Korean Beef Bowl     Asian          2352      17.95
1           Tofu Pad Thai     Asian          2248      14.50
2               Spaghetti   Italian          1468      14.50
3         Chicken Burrito   Mexican          1820      12.95
4        Mushroom Ravioli   Italian          1436      15.50
5            French Fries  American          2284       7.00
6           Chicken Torta   Mexican          1516      11.95
7               Hamburger  American          2488      12.95
8             Potstickers     Asian           820       9.00
9       Chips & Guacamole   Mexican           948       9.00
10     Fettuccine Alfredo   Italian           996      14.50
11             Pork Ramen     Asian          1440      17.95
12          Chips & Salsa   Mexican          1844       7.00
13          Shrimp Scampi   Italian           956      19.95
14      Eggplant Parmesan   Italian          1680      16.95
15           Mac & Cheese  American          1852       7.00
16           Cheeseburger  American          2332      13.95
17                Edamame     Asian          2480       5.00
18          Veggie Burger  American           952      10.50
19         Orange Chicken     Asian          1824      16.50
20     Cheese Quesadillas   Mexican           932      10.50
21  Spaghetti & Meatballs   Italian          1880      17.95
22        California Roll     Asian          1420      11.95
23            Steak Tacos   Mexican           856      13.95
24           Meat Lasagna   Italian          1092      17.95
25         Cheese Lasagna   Italian           828      15.50
26          Steak Burrito   Mexican          1416      14.95
27       Chicken Parmesan   Italian          1456      17.95
28            Steak Torta   Mexican          1956      13.95
29                Hot Dog  American          1028       9.00
30            Salmon Roll     Asian          1296      14.95
31                   None      None           274        NaN
32          Chicken Tacos   Mexican           492      11.95

In [108]:
q("""
SELECT 
    mi.item_name,
    mi.category,
    COUNT(od.order_id) AS total_orders,
    AVG(mi.price) AS avg_price
FROM order_details od
LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id
GROUP BY mi.item_name, mi.category
ORDER BY total_orders DESC
""")

                item_name  category  total_orders  avg_price
0               Hamburger  American          2488      12.95
1                 Edamame     Asian          2480       5.00
2        Korean Beef Bowl     Asian          2352      17.95
3            Cheeseburger  American          2332      13.95
4            French Fries  American          2284       7.00
5           Tofu Pad Thai     Asian          2248      14.50
6             Steak Torta   Mexican          1956      13.95
7   Spaghetti & Meatballs   Italian          1880      17.95
8            Mac & Cheese  American          1852       7.00
9           Chips & Salsa   Mexican          1844       7.00
10         Orange Chicken     Asian          1824      16.50
11        Chicken Burrito   Mexican          1820      12.95
12      Eggplant Parmesan   Italian          1680      16.95
13          Chicken Torta   Mexican          1516      11.95
14              Spaghetti   Italian          1468      14.50
15       Chicken Parmesan   Italian          1456      17.95
16             Pork Ramen     Asian          1440      17.95
17       Mushroom Ravioli   Italian          1436      15.50
18        California Roll     Asian          1420      11.95
19          Steak Burrito   Mexican          1416      14.95
20            Salmon Roll     Asian          1296      14.95
21           Meat Lasagna   Italian          1092      17.95
22                Hot Dog  American          1028       9.00
23     Fettuccine Alfredo   Italian           996      14.50
24          Shrimp Scampi   Italian           956      19.95
25          Veggie Burger  American           952      10.50
26      Chips & Guacamole   Mexican           948       9.00
27     Cheese Quesadillas   Mexican           932      10.50
28            Steak Tacos   Mexican           856      13.95
29         Cheese Lasagna   Italian           828      15.50
30            Potstickers     Asian           820       9.00
31          Chicken Tacos   Mexican           492      11.95
32                   None      None           274        NaN